R1
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address 172.16.4.1 255.255.255.128
Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#exit
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastethernet 0/0
Router(config-if)#no shutdown

Router(config-if)#exit
Router(config)#do wr


Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 1/0
Router(config-if)#ip address 10.0.0.1 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/0, changed state to down
Router(config-if)#exit
Router(config)#interface serial 1/2
Router(config-if)#ip address 10.0.0.5 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/2, changed state to down
Router(config-if)#exit
Router(config)#interface serial 1/1
Router(config-if)#ip address 10.0.0.9 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/1, changed state to down
Router(config-if)#exit







R2
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address 172.16.5.1 255.255.255.248
Router(config-if)#no shutdow

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#



Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 1/0
Router(config-if)#ip address 10.0.0.2 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/0, changed state to up

Router(config-if)#e
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up
Router(config-if)#exit
Router(config)#interface serial 1/2
Router(config-if)#ip address 10.0.0.13 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/2, changed state to down
Router(config-if)#exit
Router(config)#interface serial 1/1
Router(config-if)#ip address 10.0.0.21 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/1, changed state to down
Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#


R3
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address 172.16.4.129 255.255.255.128
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#




Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 1/1
Router(config-if)#ip address 10.0.0.22 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/1, changed state to up

Router(config-if)#exit
Router(config)#interfa
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to u
% Incomplete command.
Router(config)#interface serial 1/0
Router(config-if)#ip address 10.0.0.26 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/0, changed state to down
Router(config-if)#exit
Router(config)#interface serial 1/2
Router(config-if)#ip address 10.0.0.30 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/2, changed state to down
Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#


R4
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address 172.16.0.1 255.255.252.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#



Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 1/0
Router(config-if)#ip address 10.0.0.10 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/0, changed state to up

Router(config-if)#exit
Router(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up

Router(config)#interface serial 1/2
Router(config-if)#ip address 10.0.0.18 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial1/2, changed state to down
Router(config-if)#exit
Router(config)#interface serial 1/1
Router(config-if)#ip address 10.0.0.29 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up

Router(config-if)#exit
Router(config)#do wr


R5
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 1/2
Router(config-if)#ip address 10.0.0.6 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/2, changed state to up

Router(config-if)#exit
Router(config)#interface serial 1/1
Router(config-if)#ip address 10.0.0.17 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up

Router(config-if)#exit
Router(config)#interface serial 1/3
Router(config-if)#ip address 10.0.0.23 255.255.255.252
Bad mask /30 for address 10.0.0.23
Router(config-if)#ip address 10.0.0.25 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/3, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/3, changed state to up

Router(config-if)#exit
Router(config)#interface serial 1/0
Router(config-if)#ip address 10.0.0.14 255.255.255.252
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial1/0, changed state to up

Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up

Router(config-if)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#


R2
Router>enable
Router#config t
Router(config)#hostname R2
R2(config)#no ip domain-lookup
R2(config)#banner motd #Router protegido Edelberto#
R2(config)#line vty 0 4
R2(config-line)#password Redes1
R2(config-line)#login
R2(config-line)#logging synchronous
R2(config-line)#exit
R2(config)#line con 0
R2(config-line)#password Redes1
R2(config-line)#login
R2(config-line)#logging synchronous
R2(config-line)#exit
R2(config)#enable secret Redes1


DIRECCIONAMIENTO DINAMICO CON RIP EN R1

R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#network 10.0.0.0
R1(config-router)#network 10.0.0.4
R1(config-router)#network 10.0.0.8
R1(config-router)#network 172.16.4.0
R1(config-router)#no auto-summary
R1(config-router)#default-information originate
R1(config-router)#exit
R1(config)#exit


DIRECCIONAMIENTO DINAMICO CON RIP EN R2

R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router rip
R2(config-router)#version 2
R2(config-router)#network 10.0.0.0
R2(config-router)#network 10.0.0.12
R2(config-router)#network 10.0.0.20
R2(config-router)#network 172.16.5.0
R2(config-router)#no auto-summary
R2(config-router)#default-information originate

CONFIGURACIÓN DEL ROUTER 3

Router#config t
Router(config)#hostname R3
R3(config)#no ip domain-lookup
----------configuracion de RIPv2-----------
R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#no auto-summary
R3(config-router)#network 10.0.0.22
R3(config-router)#network 10.0.0.26
R3(config-router)#network 10.0.0.30
R3(config-router)#network 172.16.4.129
R3(config-router)#default-information originate
R3(config-router)#exit

R3(config)#banner motd #EL INGRESO HA ESTE DISPOSITIVO NO ESTA PERMITIDO!!!!#
R3(config)#line vty 0 4
R3(config-line)#password Redes1
R3(config-line)#login
R3(config-line)#loggin synchronous
R3(config-line)#exit

R3(config)#line con 0
R3(config-line)#password Redes1
R3(config-line)#login
R3(config-line)#loggin synchronous
R3(config-line)#exit

R3(config)#service password-encryption
R3(config)#enable secret Redes1

**************CONFIGURACIÓN DEL ROUTER 4******************

Router>enable
Router#config t
Router(config)#hostname R4
R4(config)#banner motd #EL ACCESO HA ESTE EQUIPO, NO ESTA PERMITIDO#
R4(config)#no ip domain-lookup

R4(config)#router rip 
R4(config-router)#version 2
R4(config-router)#no auto-summary
R4(config-router)#network 10.0.0.8
R4(config-router)#network 10.0.0.16
R4(config-router)#network 10.0.0.28	
R4(config-router)#network 172.16.0.0
R4(config-router)#default-information originate
R4(config-router)#exit

R4(config)#line vty 0 4
R4(config-line)#password Redes1
R4(config-line)#login
R4(config-line)#logging synchronous
R4(config-line)#exit

R4(config)#line con 0
R4(config-line)#password Redes1
R4(config-line)#login
R4(config-line)#logging synchronous
R4(config-line)#exit

R4(config)#enable secret Redes1 
R4(config)#service password-encryption


**************CONFIGURACIÓN DEL ROUTER 5******************
Router>enable
Router#config t
Router(config)#no ip domain-lookup
Router(config)#hostname R5
R5(config)#enable secret Redes1

R5(config)#line vty 0 4 
R5(config-line)#password Redes1
R5(config-line)#login
R5(config-line)#logging synchronous
R5(config-line)#exit

R5(config)#lin con 0
R5(config-line)#password Redes1
R5(config-line)#login
R5(config-line)#logging synchronous
R5(config-line)#exit

R5(config)#banner motd #EL ACCESO HA ESTE DISPOSITIVO ESTA RESTRINGIDO!#
R5(config)#service password-encryption 


R5(config)#router rip
R5(config-router)#version 2
R5(config-router)#no auto-summary
R5(config-router)#network 10.0.0.4
R5(config-router)#network 10.0.0.12
R5(config-router)#network 10.0.0.16
R5(config-router)#network 10.0.0.24
R5(config-router)#default-information originate
R5(config-router)#exit